import type { Article, ArticleDetail } from "@/lib/apis/article";

export const ARTICLE_LIST: Article[] = [
  {
    id: 1,
    thumbnail: "/article/46f1606e-eea3-42de-a2ca-071f981ee74c_thumb_2.png",
    title: "당근의 리브랜딩은 어떻게 시작되었나",
    description: "당근 리브랜딩 비하인드 스토리 ① 리브랜딩 과정 톺아보기",
    category: "service",
  },
  {
    id: 2,
    thumbnail:
      "/article/a50d4193-61b3-4a32-a721-d41d362b6344_2_Linus_still.png",
    title: "3번의 지원, 5배의 성장",
    description: "광고실 백엔드 엔지니어 인터뷰 | 2024 전직군 공개 채용",
    category: "career",
  },
  {
    id: 3,
    thumbnail:
      "/article/7c932af3-1615-471c-82be-4ff03ad66f61_3_sophie_still+(1).png",
    title: "하나의 가설로 극한의 성과를",
    description: "알바팀 프로덕트 디자이너 인터뷰 | 2024 전직군 공개 채용",
    category: "career",
  },
  {
    id: 4,
    thumbnail: "/article/b69ed0e0-d4c0-448a-bdf2-423cac9e7b28_1_Yeda_still.png",
    title: "일상을 연결한다는 기쁨",
    description: "중고거래실 PM 인터뷰 | 2024 전직군 공개 채용",
    category: "career",
  },
  {
    id: 5,
    thumbnail: "/article/d9b81134-7c20-4f42-be91-e2b04646cb7a_5_Jin_still.png",
    title: "당근의 협업은 무엇이 다를까",
    description: "피드실 머신러닝 엔지니어 인터뷰 | 2024 전직군 공개 채용",
    category: "career",
  },
  {
    id: 6,
    thumbnail:
      "/article/3c40b8d7-7efa-47c3-a2d4-5be356f5b11d_4_Bailey_still.png",
    title: "데이터를 빛내는 조직의 힘",
    description: "검색실 데이터 분석가 인터뷰 | 2024 전직군 공개 채용",
    category: "career",
  },
  {
    id: 7,
    thumbnail: "/article/86e58cdc-50a7-4c39-93ac-37fc072430cc_thumb.png",
    title: "동네 소식 연결하는 슈퍼 피드를 향하여",
    description: "피드 인프라팀, 다양한 동네 콘텐츠를 서빙하는 법",
    category: "service",
  },
  {
    id: 8,
    thumbnail: "/article/ffd08d03-9f52-4b22-857f-8905ab90183a_vthumb_1.png",
    title: "전단지를 대체할 당근 광고의 등장",
    description: "당근 광고실을 소개합니다!",
    category: "service",
  },
  {
    id: 9,
    thumbnail: "/article/445c591f-8d68-410b-8d57-9cbfb871eef8_thumb_1-b.png",
    title: "여기가 당근 찜질방이라면서요?",
    description: "service 운영실이 일하는 방식③ 뜨끈뜨끈 운영실 문화 대탐방",
    category: "culture",
  },
  {
    id: 10,
    thumbnail: "/article/b88a007d-c0de-4af1-8c5e-e590f62b5f72_thumb_1.png",
    title: "당근 운영실에는 냉장고와 모자가 있다",
    description:
      "service 운영실이 일하는 방식② 사용자 중심, 그거 어떻게 하는 건데",
    category: "culture",
  },
];

export const ARTICLE_DETAIL: ArticleDetail[] = [
  {
    id: 1,
    thumbnail: "/article/46f1606e-eea3-42de-a2ca-071f981ee74c_thumb_2.png",
    title: "당근의 리브랜딩은 어떻게 시작되었나",
    date: "2024-01-31",
    category: "service",
    contents: `<div class="c-iuQeVZ"><section class="c-dgmGif"><p class="c-cJFoND">2023년 여름, ‘당근다움’을 더욱 선명히 하는 <a data-id="post-hyperlink" data-link="blog/archive/%EB%8B%B9%EA%B7%BC-%EB%A6%AC%EB%B8%8C%EB%9E%9C%EB%94%A9-%EC%84%9C%EB%B9%84%EC%8A%A4%EB%AA%85-%EB%A1%9C%EA%B3%A0-%EB%A6%AC%EB%89%B4%EC%96%BC/" href="https://about.daangn.com/blog/archive/%EB%8B%B9%EA%B7%BC-%EB%A6%AC%EB%B8%8C%EB%9E%9C%EB%94%A9-%EC%84%9C%EB%B9%84%EC%8A%A4%EB%AA%85-%EB%A1%9C%EA%B3%A0-%EB%A6%AC%EB%89%B4%EC%96%BC/">리브랜딩</a>을 통해 우리는 ‘당근’이라는 새로운 이름으로 첫걸음을 뗐습니다. 지난했던 여정을 돌아보는 글을 한 편 쓰고 싶다고 다짐했으나, 리브랜딩 이후의 전략들을 하나둘 수행하다 보니 시간이 훌쩍 흘렀네요. 당근 팀은 리브랜딩을 계기로 더욱 단단하고 당근다워진 모습으로 함께 달려가고 있습니다.</p><p class="c-cJFoND"></p><p class="c-cJFoND">첫 브랜드 디자이너로 당근에 입사해 20여 명의 리브랜딩 TF를 이끌기까지, 만만했던 순간은 없었는데요. 온 마음과 힘을 다해 나아갔던 그 2년간의 여정을 톺아보며, 비하인드 스토리를 나누어 보려고 합니다.&nbsp;</p><p class="c-cJFoND"></p><p class="c-cJFoND"></p><h2 class="c-bxHxLq"><strong>리브랜딩, 그 여정의 시작&nbsp;</strong></h2><p class="c-cJFoND">2020년, 브랜딩팀 슬랙 채널에 메시지 하나가 올라왔습니다. 창업자이자 공동대표인 Gary가 남긴 글이었습니다. ‘앱 이름을 당근마켓에서 당근으로 바꿔 볼까요?’ 이 한 줄의 제안을 시작으로 당근의 리브랜딩 이야기가 수면 위로 올라왔습니다.&nbsp;</p><p class="c-cJFoND"></p><p class="c-cJFoND">그즈음, 저는 입사 5개월 차 당근 뉴비이자 브랜딩팀의 첫 번째 브랜드 디자이너였습니다. 당근에 오면서 ‘언젠가 리브랜딩 하겠지’ 막연하게 생각한 적은 있지만 그날이 이렇게 빨리 오게 될 줄은 몰랐습니다.</p><p class="c-cJFoND"></p><p class="c-cJFoND">사실 ‘당근’이라는 이름은 그다지 낯선 것은 아니었습니다. 사용자들이 하나둘 당근이라고 불러주기 시작한 덕분도 있겠지만, 당근이라는 이름에는 숨겨진 비밀이 하나 더 있었기 때문입니다. 당근이 처음 시작된 2015년, 지역 생활 커뮤니티에 진심이었던 창립 멤버들은 ‘당신 근처’의 줄임말인 ‘당근’으로 서비스명을 짓고 싶어 했지만, 야채 이름의 서비스명이 다소 파격적이라 중고 직거래를 뜻하는 ‘마켓’을 붙여 ‘당근마켓’으로 시작했다는 일화입니다.</p><p class="c-cJFoND"></p><p class="c-cJFoND">하지만 8년의 경험이 겹겹이 쌓인 서비스 이름을 바꾸는 것은 결코 단순한 작업이 아니었습니다. ‘마켓’을 그냥 떼어버리고 마는 게 아니라, ‘왜’ 떼었는지 내외부 고객에게 설득력 있고 공감이 가는 방식으로 전달하는 게 필요했죠.&nbsp;</p></section><section class="c-icNJoE"><svg width="70" height="30" viewBox="0 0 300 200"><line x1="60" x2="400" y1="100" y2="100" stroke="#adb1ba" stroke-width="50" stroke-linecap="round" stroke-dasharray="1, 120"></line></svg></section><section class="c-dgmGif"><p class="c-cJFoND">같은 해 가을 막 입사한 브랜드마케터 Jerome과 리브랜딩의 문을 여는 담론을 시작했습니다. 이때까지만 해도 리브랜딩 여정이 한눈에 그려지지 않았습니다. 오래도록 사랑받은 ‘당근마켓’이라는 이름이 익숙하던 때여서, 내부에서도 이름을 바꾸려는 시도 자체를 어색하게 느끼는 구성원도 있었고요. 무엇보다 서비스가 무서운 기세로 성장하던 때였습니다. 1년이 안 되는 시간 동안 MAU가 700만에서 1400만으로 로켓 성장했던 시기였으니까요. 팀 내외적으로 해결해야 하는 과제가 산더미처럼 불어나기 시작했습니다.</p><p class="c-cJFoND"></p><p class="c-cJFoND"></p><h2 class="c-bxHxLq"><strong>성장하는 조직에서 브랜딩을 이야기하다</strong></h2><h3 class="c-gtqMoS">우선순위, 그것이 문제로다&nbsp;</h3><p class="c-cJFoND">빠르게 성장하는 조직에서는 하루가 다르게 상황이 변하고 대응해야 할 일도 넘쳐납니다. 측정할 수 있는 목표와 성과를 위해 달리고 있는 스타트업에서, 어떤 이는 브랜드의 정체성과 비전에 대한 이야기가 호사스러운 것이라 생각할지 모릅니다.&nbsp;</p><p class="c-cJFoND"></p><p class="c-cJFoND">기업의 인하우스 조직에서 전사 리브랜딩과 같은 장기 구축성 프로젝트를 운영 업무와 병행하는 것은 실로 어려운 일인데요. 당근처럼 브랜딩의 중요성을 인지하는 조직에서조차 그 균형을 쉬이 맞출 수 없었습니다. 결국 중고거래를 넘은 로컬 커뮤니티로서의 포부를 간직한 채, 2020년 리브랜딩 프로젝트는 우선순위 테이블 중 2번, ‘중요한데 시급하지 않아 언제 할지 결정해야 하는’ 업무로 들어가게 됩니다.</p></section><section class="c-kecjBp"><img alt="성장하는 조직에서 ‘중요한데 급하지 않은 일(우선순위 2)’은 ‘중요하고 시급한 일(우선순위 1)’에 패한다. 그리고 브랜딩팀은 다른 조직들의 우선순위 1번 업무가 집결하는 곳이다." src="https://about.daangn.com/static/30d68c5302fa14f1bb1e56b213cbb29e/391e8/0cc07ae4-16b0-412a-9b6b-2769dd2fc3b5_rebranding_prior_(2).jpg"><p class="c-brVOBJ">성장하는 조직에서 ‘중요한데 급하지 않은 일(우선순위 2)’은 ‘중요하고 시급한 일(우선순위 1)’에 패한다. 그리고 브랜딩팀은 다른 조직들의 우선순위 1번 업무가 집결하는 곳이다.</p></section><section class="c-dgmGif"><p class="c-cJFoND">하루가 다르게 치솟는 브랜드 인지도에 비해 브랜드 자산은 오래전 그 모습 그대로였고, 고객이 보는 많은 것들이 브랜드 디자인의 통제 범위에 들어오지 못했습니다. 네이밍 문제 말고도 당장에 브랜드적으로 규정이 필요한 사안들이 사방에 펼쳐져 있었죠. 이런 문제들을 단번에 해결하려는 것은 마치 달리고 있는 차의 바퀴를 갈려고 시도하는 것과 같았습니다. 하지만 해내야 했습니다.&nbsp;</p><p class="c-cJFoND">급격히 늘어가는 운영 업무와 성장 과제 속에서, 저와 동료들은 ‘린(Lean) 브랜딩’이라는 새로운 방식을 받아들이기로 합니다.</p><p class="c-cJFoND"></p><p class="c-cJFoND"></p><h3 class="c-gtqMoS">Lean, 브랜딩에서도 이게 된다고?</h3></section><section class="c-kecjBp"><img alt="출처 https://blog.crisp.se/2016/01/25/henrikkniberg/making-sense-of-mvp" src="https://about.daangn.com/static/e8864fc5773d341b39479e5bb59d8b34/bf44a/497d471c-a437-4cf7-8d1c-abffd41d1427_rebranding_ref.jpg"><p class="c-brVOBJ">출처 https://blog.crisp.se/2016/01/25/henrikkniberg/making-sense-of-mvp</p></section><section class="c-dgmGif"><p class="c-cJFoND">위 그림은 당근에 입사하면 신규 입사자 교육 때 만나게 되는 그림입니다. 린 애자일 방법론에서 언급하는 MVP(Minimum Viable Product·최소기능제품)의 가치를 설명하는 대표적인 예시이죠. 첫 번째 방법은 자동차라는 제품을 만들기 위해 바퀴, 차체 등 부분 요소를 단계별로 추가해 갑니다. 또 다른 방법은 일단 ‘바퀴로 빠르게 이동할 수 있다’는 최소한의 기능을 유지하면서 제품을 점진적으로 만들어 가죠. 첫 번째 방법은 자동차를 만드는 긴 시간 동안 사용자가 이동 문제를 해결할 수 없지만, 두 번째 방법은 당장 탈 수 있는 최소한의 수단을 제공하고 이를 발전시키며 결과적으로 사용자에게 더 큰 만족을 줄 수 있습니다. 당근의 모든 서비스는 이 두 번째 방법으로 만들어집니다.</p><p class="c-cJFoND"></p><p class="c-cJFoND">MVP 개념을 브랜딩 업무에 적용한다면, ‘당장 전달할 수 있는 최소한의 요소만으로 브랜드 경험을 만들고 점진적으로 발전시킨다’로 풀어볼 수 있을 것입니다. 예를 들어 브랜드 자산의 활용 정책이나 가이드가 마련되지 않았어도, 이 룩앤필(Look and Feel)이 우리 브랜드를 대표하는지 확신이 서지 않아도, 가지고 있는 최소한의 자원을 최대로 활용하여 좋은 브랜드 경험을 만들고 계속해서 발전시키는 거죠.</p><p class="c-cJFoND"></p><p class="c-cJFoND">그런데 이게 정말 가능한 걸까요? 브랜딩에서 ‘최소’는 무엇일까요? 애석하게도 소프트웨어 제품과 달리, 브랜딩이라는 인식 게임에서는 뇌리에 박힌 인상, 그것이 곧 브랜딩이 됩니다. 자동차 회사를 보여주고 싶었는데, 의도치 않게 바퀴 회사 혹은 킥보드 회사라는 브랜드 이미지가 생길 수 있는 것이죠. 그렇기 때문에 린 브랜딩 과정에서 퀄리티를 타협하는 것은 언제나 괴로운 선택지이며, 타협을 하지 않는다면 그것대로 매우 도전적인 상황에 처하게 됩니다. </p></section><section class="c-kecjBp"><img alt="린 브랜딩도 처음부터 성능과 디자인이 완벽한 자동차를 내놓는 건 아니다. 그러나 중요한 건 매번 어쨌든 '자동차'를 완성해야 한다는 것이다. 이 점이 최소 기능부터 선보일 수 있는 소프트웨어 개발 방식과 다른 점이다. (그림 Rachel)" src="https://about.daangn.com/static/600cbc3ad9bde60343e51ca51eb04f43/a26dd/4ee12c8c-52dd-4043-a6d6-d90549223fc9_rebranding_lean.jpg"><p class="c-brVOBJ">린 브랜딩도 처음부터 성능과 디자인이 완벽한 자동차를 내놓는 건 아니다. 그러나 중요한 건 매번 어쨌든 '자동차'를 완성해야 한다는 것이다. 이 점이 최소 기능부터 선보일 수 있는 소프트웨어 개발 방식과 다른 점이다. (그림 Rachel)</p></section><section class="c-dgmGif"><p class="c-cJFoND">당근 브랜딩 조직이 받아들인 ‘린 브랜딩’ 방식을 그림으로 그려보면 위와 같습니다. 린 브랜딩에서는 킥보드만 만들어낼 순 없습니다. 최종적으로 좋은 자동차를 꿈꾼다면 적어도 모든 과정에서 그럴싸한 자동차를 만들어 내야 하죠. 당장 만족할 수 있는 기준을 합의해 가면서도 장기적으로 완성할 그림을 잘 이해하며 끝내 완성해 내는 것, 그 사이의 밸런스를 맞추는 것이 매우 중요했습니다. 그렇게 린 브랜딩은 IT 스타트업 문화에 어렵게 적응해 낸 또 하나의 브랜딩 방법론으로 자리 잡습니다.</p></section><section class="c-icNJoE"><svg width="70" height="30" viewBox="0 0 300 200"><line x1="60" x2="400" y1="100" y2="100" stroke="#adb1ba" stroke-width="50" stroke-linecap="round" stroke-dasharray="1, 120"></line></svg></section><section class="c-dgmGif"><p class="c-cJFoND">장기적인 구축과 현재에 충실한 발산, 둘 사이의 힘겨운 줄다리기가 이어졌지만 이는 한편으로 무척 자연스러운 일이었습니다. 브랜드는 그 자체로 독립적인 것이 아니라 언제나 실체, 즉 서비스를 투영해야 하는 운명이기 때문입니다. 역동적으로 커 나가는 서비스를 브랜딩 할 때는 그 역동성이 반영되기 마련인 것이죠. 따라서 당근의 많은 브랜딩 과제들은 멈춰 있는 가이드보다, 살아있는 맥락 위에서 답을 찾게 되는 일이 더 많았습니다.</p><p class="c-cJFoND"></p><p class="c-cJFoND">그러나 브랜딩이 이처럼 서비스의 폭발적인 성장과 역동성을 따라가기 위해서는 역설적으로 어떤 변화에도 흔들리지 않는 선명한 구심점이 있어야 한다는 것 또한 알고 있었습니다. 중심부가 단단하지 않은 상태에서 서비스와 조직이 스케일업을 맞이한다면 결국 취약해져 파편화되고 크리에이티브는 이탈되어 혼란에 빠지기 쉽습니다. 이런 문제 인식에서 이번 리브랜딩은 당근 안의 구심점을 선명하게 나타내고 가리킬 수 있는 대내외적인 모멘텀이 되어야만 한다고 생각했죠.</p><p class="c-cJFoND"></p><p class="c-cJFoND">눈코 뜰 새 없이 바쁜 나날을 보내며 리브랜딩에 발을 내딛지 못하는 날이 계속되던 2021년 7월, 경영진과 전사 리더가 모인 미팅에서 드디어 리브랜딩 프로젝트의 본격적인 시작을 합의했고, 그렇게 ‘당근다움’을 찾아가는 기나긴 여정이 시작되었습니다.&nbsp;</p><p class="c-cJFoND"></p><p class="c-cJFoND"></p><h2 class="c-bxHxLq"><strong>당근다움을 찾아가는 과정&nbsp;</strong></h2></section><section class="c-dgmGif"><img src="https://images.prismic.io/karrot/2d9e8895-6202-49b0-bcf0-4a17a1064f11_rebranding_chart_01+%282%29.png?auto=compress,format" class="c-jwERLD"></section><section class="c-dgmGif"><p class="c-cJFoND">당근의 리브랜딩은 크게 3개 Phase를 거쳐 진행되었습니다.&nbsp;</p><ul class="c-gEQRoa"><li><strong>Phase 1 Research &amp; Verbal Identity: </strong>브랜드 인식 조사, 문제 정의 및 변화 폭 설정, 언어적 정체성 정의</li><li><strong>Phase 2 Visual Identity: </strong>비주얼 요소 진단, 무드보드, 서체 디자인, 심볼 &amp; 디자인 가이드</li><li><strong>Phase 3 Campaign &amp; Application : </strong>브랜드 필름 &amp; BI 영상, 랜딩페이지 &amp; 프로모션, 블로그 아티클, BI 교체 배포</li></ul><p class="c-cJFoND">각 Phase별 업무들을 타임라인 위에 놓고 보면, 2021년부터 2023년까지 대략 아래와 같은 흐름을 지나온 걸 알 수 있습니다. </p></section><section class="c-kecjBp"><img alt="Phase1은 천천히 갔지만 신중하게, Phase2는 외부 협력을 병행하며 속도감 있게, Phase3는 온 구성원들의 일사불란한 협력으로 완성했다." src="https://about.daangn.com/static/d72a9b42bb028fb5fa494d849c1eddf7/e601f/32d7bc8b-eda4-497d-a872-615ff1883ab9_rebranding_chart_02%2B(2).jpg"><p class="c-brVOBJ">Phase1은 천천히 갔지만 신중하게, Phase2는 외부 협력을 병행하며 속도감 있게, Phase3는 온 구성원들의 일사불란한 협력으로 완성했다.</p></section><section class="c-dgmGif"><p class="c-cJFoND">시기별로 각 업무 단위를 전문적으로 담당할 수 있는 리소스를 팀 내외적으로 배치하며, 전체적인 프로세스가 하나의 방향을 향해 나아가고 있는지 확인했습니다. 각 단계에 대한 구체적인 내용은 다음 편 아티클에서 더 자세히 다뤄볼 예정입니다.</p></section><section class="c-icNJoE"><hr class="c-ffexKH"></section><section class="c-dgmGif"><p class="c-cJFoND">당근 리브랜딩의 핵심은 지금까지 쌓아온 소중한 유산을 바탕으로 앞으로의 비전을 ‘더 당근답게 담아내는 것’이었습니다. 이는 처음부터 새 브랜드를 만드는 것보다 훨씬 어려울 수 있습니다. 제품 개발로 생각해 보면, 복잡하게 얽힌 레거시를 변형해 사용하는 것보다 아예 처음부터 다시 짜는 게 더 빠른 것과 비슷할 것입니다.</p><p class="c-cJFoND"></p><p class="c-cJFoND">전국의 당근 이웃들과 가까운 유대 관계를 맺어오며 대중의 긍정적인 인식을 높였던 당근은 사실 완전히 새로워질 이유가 없었습니다. 심미성이 변화의 유일한 목적이 되어서도 안 되었죠. 그럼 당근은 왜 리브랜딩을 결심해야 했으며, 그 과정에서 어떤 문제를 해결하고 싶었던 걸까요? 리브랜딩의 당위성은 아래 질문에서 찾을 수 있었습니다.</p><p class="c-cJFoND"></p><p class="c-cJFoND"><strong>Q. 서비스 이름이 우리의 비전을 반영하고 있는가?&nbsp;</strong></p><p class="c-cJFoND">이름은 브랜드의 시작입니다. 그 시작에는 우리의 지향성과 고객 가치가 담겨 있거나 적어도 그 방향을 인지하는 데에 혼란을 주어서는 안 됩니다. ‘당근마켓’에서 ‘마켓’은 중고거래만을 의미하고 있었고, 동네생활, 알바, 비즈니스 등 다양한 지역 기반 서비스를 포괄하는 데에 한계가 있음을 인정했습니다.</p><p class="c-cJFoND"></p><p class="c-cJFoND"><strong>Q. 브랜드의 긍정 인식이 브랜드 정체성에 반영되었는가?</strong></p><p class="c-cJFoND">리뉴얼을 준비하며, 우리는 기존 BI(브랜드 정체성·Brand Identity)가 브랜드의 긍정적 이미지를 충분히 반영하지 못하고 있다는 것을 발견했습니다. 당근이 지금의 브랜드 위상을 얻게 된 데에는, 처음부터 치밀하게 설계한 브랜드 전략에 의한 것보다는 당근을 사랑하는 수많은 이웃들의 긍정적 경험이 쌓이고 퍼진 것이 가장 컸다고 생각합니다. 그만큼 사용자의 경험은 어떤 것보다도 강력하며, 당근의 브랜드 이미지(인식)을 이루는 것에 큰 부분을 차지합니다. 따라서 사용자가 당근에 대해 가지는 긍정적 인식(Images)이 다시 브랜드 정체성(Identity)으로 하나 될 수 있도록 전반적인 고민과 촘촘한 설계가 필요했습니다.</p><p class="c-cJFoND"></p><p class="c-cJFoND">리브랜딩 과정을 통해 당근 팀은 인식과 표현의 간극을 좁히기 위해 내/외부 고객이 당근을 당근으로 느끼는 부분이 무엇인지, 우리의 어떤 면을 좋아하는지 깊게 이해하고자 했습니다. 그리고 이를 다시 우리만의 언어와 시각으로 순도 높게 거르기를 반복했어요. 이 작업은 기나긴 리브랜딩 여정의 3분의 1을 차지했을 정도로, 브랜드 리뉴얼의 이정표를 세우는 중요한 과정이기도 했습니다.</p></section><section class="c-icNJoE"><svg width="70" height="30" viewBox="0 0 300 200"><line x1="60" x2="400" y1="100" y2="100" stroke="#adb1ba" stroke-width="50" stroke-linecap="round" stroke-dasharray="1, 120"></line></svg></section><section class="c-dgmGif"><p class="c-cJFoND">당근의 리브랜딩은 브랜딩 관련 구성원들이 모인 TF로 시작하여, 단계별 미션에 맞는 협업 그룹을 추가하는 방식으로 프로세스를 밟아갔습니다. 약 2년간 누적 100여 명에 가까운 구성원들이 함께 참여한 리브랜딩은 당근에서 본 적 없는 엄청난 스케일의 협업 프로젝트였는데요. 많은 기업에서는 인하우스 조직의 시간적, 인적 자원의 한계를 뛰어넘기 위한 가장 효율적인 방법으로, 프로젝트를 시작함과 동시에 외주화하는 것을 고려하기도 합니다. 그런데 당근은 왜, 이렇게 오랜 시간, 많은 인원이 기꺼이 함께 했던 걸까요?</p><p class="c-cJFoND"></p><p class="c-cJFoND">리뉴얼 과제는 저마다 다르겠지만, 통상 어떤 브랜드의 새 로고가 아쉽게 느껴진다면 그것은 우리가 좋아했던 그 이미지를 더 이상 찾아볼 수 없는, 완전히 다른 무언가로 바뀌었을 때일 것입니다. 당근의 리브랜딩은 ‘더 다르게’가 아니라 ‘더 선명하게’ 하는 과제로서, ‘따뜻함'이라는 단어 아래 숨겨진 당근만의 독특한 심상을 아주 잘 이해해야만 했습니다. 만약 우리 스스로도 이해하거나 정의하지 못한다면 외부에서 제시한 것이 우리 브랜드에 맞다는 것을 어떻게 확신할 수 있을까요?</p><p class="c-cJFoND"></p><p class="c-cJFoND">우리 브랜드를 가장 잘 아는 건 내부 구성원이고, 또 그래야 한다는 믿음이 확고했습니다. 각자가 가진 심상이 아직 제각각이라 할 지라도 그 스펙트럼을 아는 것이 중요했고 그것들을 가다듬고 공유하는 시간이 반드시 필요했어요. 쉬운 방법은 아니었지만, 조직 내부 깊은 곳에서부터 브랜드 정체성을 한 겹 한 겹 단단하게 쌓아 올리는 원동력이 되었다고 믿습니다. 그리고 이러한 과정을 거쳤기 때문에 리브랜딩의 아웃풋인 BI, 서체, 브랜드필름, UI 모두가 하나의 일관된 방향성 안에서 총체적인 경험으로 제공될 수 있었던 것이죠.</p><p class="c-cJFoND"></p><p class="c-cJFoND">치열했던 리브랜딩은 그 시작에서부터 우리만의 시야로, 당근만의 방식을 찾기 위해 떠났던 의미 있는 여정이었습니다. 눈에 보이지 않는 인식과 감각을 선명하게 해 나가는 실무의 과정은 다음 글에서 이어가도록 하겠습니다.</p></section></div>`,
    author: {
      thumbnail:
        "https://about.daangn.com/static/6b3d55e1b90045cf01dbc535002fdf7b/eaead7ba-fbef-47fa-9faa-d1a851900254_rachel.png",
      name: "Rachel",
      description: "Branding Team Lead",
    },
    tags: ["리브랜딩", "브랜딩", "사용자경험", "회고"],
  },
  {
    id: 2,
    thumbnail:
      "/article/a50d4193-61b3-4a32-a721-d41d362b6344_2_Linus_still.png",
    title: "3번의 지원, 5배의 성장",
    date: "2023-12-20",
    category: "career",
    contents: `<div class="c-iuQeVZ"><section class="c-dgmGif"><p class="c-cJFoND">좌절을 마주한다는 것은 항상 쉬운 일이 아니죠. 좌절에 굴하지 않고 몇 번이고 도전하는 것은 더욱 어려운 일이고요. 그런데 여기, 당근에 3번 지원해서 3번 만에 합류한 이후에 팀의 리드가 되어 구성원들과 함께 놀라운 성과를 내고 있는 구성원이 있습니다. 바로 광고실 백엔드 엔지니어 Linus 이야기입니다.&nbsp;</p><p class="c-cJFoND">햇수로 무려 4년 동안 당근에 문을 두드린 Linus는 15여 년 가깝게 게임업계에서 일했지만, 한곳에 머무르는 것은 아무래도 자신이 지향하는 삶의 모습에 어울리지 않다고 생각했다고 해요. 이내 지역 기반 커뮤니티라는 낯설고도 새로운 분야를 찾아 커리어의 새로운 항해를 시작합니다. 그 항해는 당근에서 어떻게 펼쳐지고 있을까요?</p></section><section class="c-icNJoE"><svg width="70" height="30" viewBox="0 0 300 200"><line x1="60" x2="400" y1="100" y2="100" stroke="#adb1ba" stroke-width="50" stroke-linecap="round" stroke-dasharray="1, 120"></line></svg></section><section class="c-dgmGif"><h3 class="c-gtqMoS"><strong>Q. 안녕하세요. 소개 부탁드립니다!</strong></h3><p class="c-cJFoND">광고실 백엔드 엔지니어 Linus입니다. 현재는 광고실 DSP팀 리드로 있어요. 당근에는 동네 이웃들에게 가게나 업체를 소개하고 싶어하는 사장님도 많이 계신데요. 이런 상황에서 광고주가 사용할 수 있는 광고 플랫폼의 백엔드를 만드는 일을 하고 있어요.&nbsp;</p><p class="c-cJFoND"></p><h3 class="c-gtqMoS"><strong>Q. 당근에 3번 지원해 3번 만에 합격하셨다구요.&nbsp;</strong></h3><p class="c-cJFoND">맨 처음 당근에 지원했던 건 2019년 4월이니까 어느덧 4년 전 일이네요. 한 개발 행사에 가서 CTO Seapy를 만났어요. 스타트업 관계자 분들이 돌아가면서 이야기하는 행사였는데, Seapy가 당근이 꿈꾸고 있는 미래상에 대해 말씀하시더라고요. <span style="background:#FFC4F7">지역을 기반으로</span> 하는 동네 로컬 커뮤니티의 비전이 정말 인상 깊었어요. 바로 가방을 뒤져 뽑아 두었던 종이 이력서를 꺼내 직접 드렸어요. 정말 간절했거든요. 그런데 아쉽게도 연락이 안 왔어요.&nbsp;</p><p class="c-cJFoND"></p><p class="c-cJFoND">당시 당근은 지금처럼 많은 사람이 쓰는 서비스는 아니었는데, 조금씩 유명해지고 있었고 특히 개발자들 사이에서 일하고 싶은 회사로 알려지고 있는 단계였어요. 제가 아무래도 웹 개발자로서 큰 전문성은 없는 상황이었다보니 당근에 합류하기에는 조금 부족했다고 생각하고 능력을 좀 더 쌓아야겠다고 다짐했습니다.&nbsp;</p><p class="c-cJFoND"></p><p class="c-cJFoND">이후 ‘명함에 웹 개발자로 써 있는 게 이상하지 않은 사람이 되자’라는 작은 목표를 세우고 다른 회사로 이직했어요. 웹 개발자로 어느 정도 커리어를 쌓았다고 생각한 즈음 이번엔 당근페이에 지원했습니다. 하지만 또 다시 탈락했어요. 아무래도 특정 역량을 더 키우는 게 중요할 것 같아서 그 이후로 커머스 회사에서 웹 개발자로 광고 영역을 다루면서 2년 동안 그 일에만 집중했고, 이후 다시 당근에 지원했습니다. 그리고 드디어! 광고실에 합류했어요. 광고 영역을 다뤘던 게 입사에 도움이 됐던 것 같습니다.&nbsp;</p><p class="c-cJFoND"></p><h3 class="c-gtqMoS"><strong>Q. 왜 꼭 당근에 오고 싶으셨나요?</strong></h3><p class="c-cJFoND"><span style="background:#FFC4F7">더 성장하고 싶어서</span>였어요. 사실 결혼하고 나서는 끊임없이 성장해야 하는 스타트업에 대해 막연하게 부담스럽게 생각했던 적이 있어요. 복지나 혜택이 좋은 대기업이 주는 안정감이 있잖아요. 하지만 막상 그 안정감을 오래 누리는 게 즐겁지 않더라고요. 그만큼 새롭게 도전해볼 일이 없다는 뜻이기도 했으니까요. 저는 지난 14년 동안 게임 업계에서 개발자로 일했는데요. 한 업계에서 한 역할을 워낙 오래 하다 보니 어느 정도 해볼 수 있는 건 다 해본 것 같다는 생각이 들었어요. 익숙해진 곳에서 정체되고 싶지 않더라고요. 그동안 해보지 않은 웹 쪽을 해보고 싶어 웹을 다룰 수 있는 새로운 분야로 이직해야겠다고 결심했습니다.&nbsp;</p><p class="c-cJFoND"></p><p class="c-cJFoND">이직을 결심한 후 회사를 몇 개 추려보니 업계에서 일 좀 잘한다는 사람이 모여있고 치열하게 성장할 수 있는 회사를 가고 싶다고 생각했는데 당근뿐이더라고요. 탈락의 고배를 마셔야 했지만 3번 지원했고, 결국 이렇게 당근에 오게 됐습니다. 당근에서 일할 수 있게 되어 진심으로 기뻐요.&nbsp;</p><p class="c-cJFoND"></p><h3 class="c-gtqMoS"><strong>Q. 기대했던 당근의 모습대로 일하고 계신가요? 무슨 일을 하고 계신지도 궁금해요.</strong></h3><p class="c-cJFoND">새로운 것에 도전해보고 싶어 당근에 왔는데, 기본적으로 일을 좋아하고 주도적으로 이끌면서 몰입하는 사람들이 모여 있어요.&nbsp;지금 하는 일은 광고실에서 당근의 광고 플랫폼을 만들고 있는데요. 매일 아침 Slack 대시보드를 통해 광고 지표를 모두가 볼 수 있는데, 매일 상승세가 보이니 동기부여가 잘 되더라고요. 제가 입사한 시점 기준 5~6배 증가한 상황인데, 팀 전체가 하나의 목표에 <span style="background:#FFC4F7">강하게 몰입</span>하는 문화가 좋아요. 이런저런 어려움과 고난이 있지만, 지표 자체가 워낙 잘 나오고 있다 보니 그걸 해결하는 과정도 즐겁더라고요. 제품이 크는 게 눈에 보인다고 해야 하나요. 우리가 만든 제품이 시장에서 좋은 평가를 받는 걸 경험하니 그게 곧 큰 원동력이 돼요. 광고실은 인원 수도 빠르게 늘고, 양적으로 질적으로 모두 성장하고 있다고 느껴요.</p><p class="c-cJFoND"></p><p class="c-cJFoND">몰입과 협업의 힘을 가장 크게 경험을 했던 건 ‘당근 광고 전문가 모드’를 만들 때였어요. 그동안 당근 서비스는 대부분 앱 안에서 제공될 뿐 사용자를 대상으로 웹 기반 서비스가 제공되는 것은 없었는데요. 광고에 대해 잘 아시는 소상공인 분들이나 전문 마케터등을 상대로 한 광고 서비스 플랫폼을 만들어야겠다는 필요성이 생겼어요. 기존 플랫폼도 계속 만들어 나가야 하기 때문에 각 파트별 인력이 절대적으로 부족한 상황이었음에도 몇몇 백엔드 엔지니어가 열정적으로 나서서 프론트엔드의 역할까지 해 나가면서 굉장히 짧은 시간 안에 <a data-id="post-hyperlink" data-link="https://ads-pro.business.daangn.com/" href="https://ads-pro.business.daangn.com/">당근 광고 전문가 모드</a>를 런칭했습니다. 이 때 다들 힘들기도 했지만 몰입해서 한 팀으로서 일하면서 본인의 역량 이상으로 일을 해 내는 동료들의 모습에 큰 자극과 감명을 받았어요. 이미 1년도 더 된 과거의 일이지만 그때 함께 몰입했던 경험은 아직도 기분 좋은 기억으로 남아있습니다.</p><p class="c-cJFoND"></p><p class="c-cJFoND">이런 몰입의 경험은 한 번의 경험에 그치지 않더라고요. 짧은 시간 안에 함께 몰입하고 성취한 경험은 <span style="background:#FFC4F7">두터운 신뢰</span>로 쌓여 회사와 구성원 모두에게 큰 건강한 자극이 되는 걸 느꼈어요. 몰입하다보니 때론 늦은 시간까지 일하기도 했지만, 그 누구도 누가 시켜서가 아니라 한 팀으로서 이 프로젝트를 즐기면서 또 동시에 최대한 확실한 목표를 달성하기 위해 한마음으로 몰두하는 경험이 정말 좋았어요.&nbsp;</p><p class="c-cJFoND"></p><h3 class="c-gtqMoS"><strong>Q. 당근에서 백엔드 엔지니어로서 일할 때 가장 매력적인 업무 환경은 어떤 게 있을까요?&nbsp;</strong></h3><p class="c-cJFoND">앞서 이야기한 몰입의 문화가 가장 크겠지만, <span style="background:#FFC4F7">당근의 트래픽 수 자체</span>도 크게 매력적이라고 생각해요. 당근의 광고 플랫폼은 당근을 사용하는 사용자의 모든 트래픽을 받아서 짧은 시간 안에 광고를 내보내고 그 안에서 회사의 안정적인 BM으로도 역할하고 있는데요. 하루 2억 건이 넘는 광고 요청이 들어오는 규모의 트래픽을 받아낼 시스템을 어떻게 구성할지, 인프라 레벨까지 보거나 참여할 수 있는 환경이 엔지니어에게는 큰 성장의 기회가 될 거라고 생각해요.&nbsp;</p><p class="c-cJFoND"></p><p class="c-cJFoND">MAU가 큰 서비스에서 자체 광고를 운영한다는 것은 사실 큰 품이 드는 일이에요. 플랫폼 전체의 트래픽을 안정적으로 받아내는 동시에 사용자가 불편함을 느끼지 않도록 아주 빠른 시간 안에 광고를 보내줘야 하는데요. 대형 포털사나 대기업의 데이터 전담 조직 빼고는 해볼 수 없는 수준의 데이터 플랫폼을 고민하고 운영할 수 있어요. 광고주와 사용자 상대로 모든 트래픽을 버티면서 서비스를 해내는 게 백엔드 엔지니어가 성장할 수 있는 큰 매력 포인트예요. 보통 인프라 쪽은 개발자가 접근할 수 없는 것들이 있는데, 당근에서는 보안 정책 등에 위배되지 않는 선에서 인프라팀, 보안팀과 가깝게 협업하며 기여할 수도 있어요. 공용 서비스는 먼저 제안해서 직접 만들기도 하고요. 그만큼 누구든 자신의 일에 몰입할 수 있어요.</p><p class="c-cJFoND"></p><p class="c-cJFoND">또 한 가지 꼽자면... 백엔드 언어가 굉장히 다양하다는 것도 있어요. 쉽게 말하면 <span style="background:#FFC4F7">기술 스택의 자유도</span>가 굉장히 높은 편인데요. 장점이자 단점일 수도 있지만, 실패를 두려워하지 않고 도전을 장려하고 그런 분위기에서 동료들을 믿고 성장할 수 있는 문화가 있다는 게 좋은 포인트라고 생각해요. 가끔 팀끼리 서로 만나 이야기 나누는 자리도 있는데, 어제 나온 기술을 오늘 도입하는 팀을 보고 있으면 정말 흥미로워요. 같은 당근 안에서도 팀마다, 또 파트마다 문화가 저마다 특징을 가진 채로 점점 발전하고 있는 것 같아요.&nbsp;</p><p class="c-cJFoND"></p><h3 class="c-gtqMoS"><strong>Q. 당근의 전반적인 개발 문화도 궁금해요.&nbsp;</strong></h3><p class="c-cJFoND">문화라고 할 수 있으려나 모르겠지만, <span style="background:#FFC4F7">뛰어난 동료</span>가 정말 많아요. 잘하는 개발자 옆에, 또 잘하는 개발자가 있는 느낌이랄까요. 이직할 당시에 ‘우리는 어떤 회사에 다니고 싶은가?’라고 업계 사람들과 이야기 나눈 적이 있는데요. 프로덕트나 도메인이 아주 큰 흥미 없더라도 결국 함께 일하는 동료가 유능하고 신뢰할 수 있으면 재미있게 다닐 수 있을 거라는 말에 모두가 고개를 끄덕였어요. 당근에는 내 등을 맡길 수 있는 사람이 많아요. 등을 맡긴다, 등을 맞댄다는 게 정말 쉬운 일이 아닌데 ‘뭘해도 만들 수 있겠다’ 싶은 동료가 많아 서로 신뢰할 수 있게 되더라고요.&nbsp;</p><p class="c-cJFoND"></p><p class="c-cJFoND">나아가 회사 자체의 문화가 개발자 중심의 문화라는 것도 인상 깊어요. 당근은 모두가 한 명의 사업가, 대표처럼 프로덕트를 만드는 메이커라고 생각하는데요. 아무래도 창업자와 초기 멤버 대부분이 개발자였다 보니, 개발자 중심으로 사고하고 업무하는 문화가 자연스러워진 것 같아요.&nbsp;</p><p class="c-cJFoND"></p><h3 class="c-gtqMoS"><strong>Q. 일에 대한 몰입력이 굉장히 강한 것 같아요. 앞으로의 커리어 계획이 있으신가요?&nbsp;</strong></h3><p class="c-cJFoND">광고실에서 커리어에 있어서 어느정도 목표를 이루고 난 후에는, 새로운 서비스를 바닥부터 만들어보고 싶다는 생각이 있어요. 당근에는 창업을 꿈꾸는 사람들이 많이 모여 있어요. 저도 언젠가<strong> 당근에서의 경험을 토대로 세상을 더 이롭게 하는 서비스를 만들어 보고 싶다</strong>는 꿈을 키우고 있어요.&nbsp;</p><p class="c-cJFoND"></p><p class="c-cJFoND">회사에서의 개인적인 목표도 있어요. 같이 일할 때 든든한 사람이 되고 싶어요. 기술적으로도, 인격적으로도요. 욕심 같아서는 “저 사람에게 어떤 일이던 맡기면 원하는 결과물을 얻을 수 있어!” 정도의 동료가 되고 싶다는 욕심이 있지만, 최소한 “같이 일하기 좋았던 사람” 정도로는 기억됐으면 좋겠다는 마음으로 열심히 하고 있어요. <strong>서로에게 좋은 동료가 되어주고 싶다는 마음이 큰 원동력이 돼요. </strong></p></section><section class="c-icNJoE"><svg width="70" height="30" viewBox="0 0 300 200"><line x1="60" x2="400" y1="100" y2="100" stroke="#adb1ba" stroke-width="50" stroke-linecap="round" stroke-dasharray="1, 120"></line></svg></section><section class="c-dgmGif"><h3 class="c-gtqMoS"><strong>Q. 마지막으로 당근 지원을 앞둔 엔지니어에게 해주고 싶은 말이 있을까요?</strong></h3><p class="c-cJFoND"><strong>주도적으로 일하는 걸 좋아하신다면 혹은 서비스와 함께 성장하고 싶으신 분</strong>이라면 망설이지 말고 지원하라고 말씀 드리고 싶어요. 저의 사례에서도 그렇듯 여러 단계에서 고배를 마셨다가도 경험과 이력을 쌓고 합류하신 분들도 많아요.&nbsp;</p><p class="c-cJFoND"></p><p class="c-cJFoND">당근은 동네를 연결해 더 나은 사회를 만들어가자는 비전을 가지고 있는데요. 자신이 하는 일이 세상을 더 나은 곳으로 만들어간다는 뿌듯함과 성취감을 경험해보시면 좋겠어요. 비전에 대한 일치도가 중요하지 않다고 생각하시는 분도 있겠지만, 일치되었을 때 그 뿌듯함은 경험해보지 않으면 모를 거라는 생각도 들어요. 특히 광고실은 동네 이웃들이 필요한 광고주와 동네를 살아가는 사용자를 연결하며 가치를 만들어내고 있는데요. 비전을 향해 성장하면서 느끼는 성취감과 성장을 꼭 경험해보셨으면 좋겠어요. </p></section></div>`,
    author: {
      thumbnail:
        "https://about.daangn.com/static/5ec1d0f83d14cc19e5f1004146547909/e9ec68d0-e49d-4071-bf92-78ed3355003f_profile_daangn.png",
      name: "당근",
      description: "당신 근처의 지역 생활 커뮤니티",
    },
    tags: [
      "2024전직군채용",
      "광고",
      "백엔드",
      "뛰어난동료",
      "몰입",
      "개발문화",
    ],
  },
];
