import type { Article, ArticleDetail } from "@/lib/apis/article";

export const ARTICLE_LIST: Article[] = [
  {
    id: 1,
    thumbnail: "/article/46f1606e-eea3-42de-a2ca-071f981ee74c_thumb_2.png",
    title: "당근의 리브랜딩은 어떻게 시작되었나",
    description: "당근 리브랜딩 비하인드 스토리 ① 리브랜딩 과정 톺아보기",
    category: "service",
  },
  {
    id: 2,
    thumbnail:
      "/article/a50d4193-61b3-4a32-a721-d41d362b6344_2_Linus_still.png",
    title: "3번의 지원, 5배의 성장",
    description: "광고실 백엔드 엔지니어 인터뷰 | 2024 전직군 공개 채용",
    category: "career",
  },
  {
    id: 3,
    thumbnail:
      "/article/7c932af3-1615-471c-82be-4ff03ad66f61_3_sophie_still+(1).png",
    title: "하나의 가설로 극한의 성과를",
    description: "알바팀 프로덕트 디자이너 인터뷰 | 2024 전직군 공개 채용",
    category: "career",
  },
  {
    id: 4,
    thumbnail: "/article/b69ed0e0-d4c0-448a-bdf2-423cac9e7b28_1_Yeda_still.png",
    title: "일상을 연결한다는 기쁨",
    description: "중고거래실 PM 인터뷰 | 2024 전직군 공개 채용",
    category: "career",
  },
  {
    id: 5,
    thumbnail: "/article/d9b81134-7c20-4f42-be91-e2b04646cb7a_5_Jin_still.png",
    title: "당근의 협업은 무엇이 다를까",
    description: "피드실 머신러닝 엔지니어 인터뷰 | 2024 전직군 공개 채용",
    category: "career",
  },
  {
    id: 6,
    thumbnail:
      "/article/3c40b8d7-7efa-47c3-a2d4-5be356f5b11d_4_Bailey_still.png",
    title: "데이터를 빛내는 조직의 힘",
    description: "검색실 데이터 분석가 인터뷰 | 2024 전직군 공개 채용",
    category: "career",
  },
  {
    id: 7,
    thumbnail: "/article/86e58cdc-50a7-4c39-93ac-37fc072430cc_thumb.png",
    title: "동네 소식 연결하는 슈퍼 피드를 향하여",
    description: "피드 인프라팀, 다양한 동네 콘텐츠를 서빙하는 법",
    category: "service",
  },
  {
    id: 8,
    thumbnail: "/article/ffd08d03-9f52-4b22-857f-8905ab90183a_vthumb_1.png",
    title: "전단지를 대체할 당근 광고의 등장",
    description: "당근 광고실을 소개합니다!",
    category: "service",
  },
  {
    id: 9,
    thumbnail: "/article/445c591f-8d68-410b-8d57-9cbfb871eef8_thumb_1-b.png",
    title: "여기가 당근 찜질방이라면서요?",
    description: "service 운영실이 일하는 방식③ 뜨끈뜨끈 운영실 문화 대탐방",
    category: "culture",
  },
  {
    id: 10,
    thumbnail: "/article/b88a007d-c0de-4af1-8c5e-e590f62b5f72_thumb_1.png",
    title: "당근 운영실에는 냉장고와 모자가 있다",
    description:
      "service 운영실이 일하는 방식② 사용자 중심, 그거 어떻게 하는 건데",
    category: "culture",
  },
];

export const ARTICLE_DETAIL: ArticleDetail[] = [
  {
    id: 2,
    thumbnail:
      "/article/a50d4193-61b3-4a32-a721-d41d362b6344_2_Linus_still.png",
    title: "3번의 지원, 5배의 성장",
    date: "2023-12-20",
    category: "career",
    contents: `<div class="c-iuQeVZ"><section class="c-dgmGif"><p class="c-cJFoND">좌절을 마주한다는 것은 항상 쉬운 일이 아니죠. 좌절에 굴하지 않고 몇 번이고 도전하는 것은 더욱 어려운 일이고요. 그런데 여기, 당근에 3번 지원해서 3번 만에 합류한 이후에 팀의 리드가 되어 구성원들과 함께 놀라운 성과를 내고 있는 구성원이 있습니다. 바로 광고실 백엔드 엔지니어 Linus 이야기입니다.&nbsp;</p><p class="c-cJFoND">햇수로 무려 4년 동안 당근에 문을 두드린 Linus는 15여 년 가깝게 게임업계에서 일했지만, 한곳에 머무르는 것은 아무래도 자신이 지향하는 삶의 모습에 어울리지 않다고 생각했다고 해요. 이내 지역 기반 커뮤니티라는 낯설고도 새로운 분야를 찾아 커리어의 새로운 항해를 시작합니다. 그 항해는 당근에서 어떻게 펼쳐지고 있을까요?</p></section><section class="c-icNJoE"><svg width="70" height="30" viewBox="0 0 300 200"><line x1="60" x2="400" y1="100" y2="100" stroke="#adb1ba" stroke-width="50" stroke-linecap="round" stroke-dasharray="1, 120"></line></svg></section><section class="c-dgmGif"><h3 class="c-gtqMoS"><strong>Q. 안녕하세요. 소개 부탁드립니다!</strong></h3><p class="c-cJFoND">광고실 백엔드 엔지니어 Linus입니다. 현재는 광고실 DSP팀 리드로 있어요. 당근에는 동네 이웃들에게 가게나 업체를 소개하고 싶어하는 사장님도 많이 계신데요. 이런 상황에서 광고주가 사용할 수 있는 광고 플랫폼의 백엔드를 만드는 일을 하고 있어요.&nbsp;</p><p class="c-cJFoND"></p><h3 class="c-gtqMoS"><strong>Q. 당근에 3번 지원해 3번 만에 합격하셨다구요.&nbsp;</strong></h3><p class="c-cJFoND">맨 처음 당근에 지원했던 건 2019년 4월이니까 어느덧 4년 전 일이네요. 한 개발 행사에 가서 CTO Seapy를 만났어요. 스타트업 관계자 분들이 돌아가면서 이야기하는 행사였는데, Seapy가 당근이 꿈꾸고 있는 미래상에 대해 말씀하시더라고요. <span style="background:#FFC4F7">지역을 기반으로</span> 하는 동네 로컬 커뮤니티의 비전이 정말 인상 깊었어요. 바로 가방을 뒤져 뽑아 두었던 종이 이력서를 꺼내 직접 드렸어요. 정말 간절했거든요. 그런데 아쉽게도 연락이 안 왔어요.&nbsp;</p><p class="c-cJFoND"></p><p class="c-cJFoND">당시 당근은 지금처럼 많은 사람이 쓰는 서비스는 아니었는데, 조금씩 유명해지고 있었고 특히 개발자들 사이에서 일하고 싶은 회사로 알려지고 있는 단계였어요. 제가 아무래도 웹 개발자로서 큰 전문성은 없는 상황이었다보니 당근에 합류하기에는 조금 부족했다고 생각하고 능력을 좀 더 쌓아야겠다고 다짐했습니다.&nbsp;</p><p class="c-cJFoND"></p><p class="c-cJFoND">이후 ‘명함에 웹 개발자로 써 있는 게 이상하지 않은 사람이 되자’라는 작은 목표를 세우고 다른 회사로 이직했어요. 웹 개발자로 어느 정도 커리어를 쌓았다고 생각한 즈음 이번엔 당근페이에 지원했습니다. 하지만 또 다시 탈락했어요. 아무래도 특정 역량을 더 키우는 게 중요할 것 같아서 그 이후로 커머스 회사에서 웹 개발자로 광고 영역을 다루면서 2년 동안 그 일에만 집중했고, 이후 다시 당근에 지원했습니다. 그리고 드디어! 광고실에 합류했어요. 광고 영역을 다뤘던 게 입사에 도움이 됐던 것 같습니다.&nbsp;</p><p class="c-cJFoND"></p><h3 class="c-gtqMoS"><strong>Q. 왜 꼭 당근에 오고 싶으셨나요?</strong></h3><p class="c-cJFoND"><span style="background:#FFC4F7">더 성장하고 싶어서</span>였어요. 사실 결혼하고 나서는 끊임없이 성장해야 하는 스타트업에 대해 막연하게 부담스럽게 생각했던 적이 있어요. 복지나 혜택이 좋은 대기업이 주는 안정감이 있잖아요. 하지만 막상 그 안정감을 오래 누리는 게 즐겁지 않더라고요. 그만큼 새롭게 도전해볼 일이 없다는 뜻이기도 했으니까요. 저는 지난 14년 동안 게임 업계에서 개발자로 일했는데요. 한 업계에서 한 역할을 워낙 오래 하다 보니 어느 정도 해볼 수 있는 건 다 해본 것 같다는 생각이 들었어요. 익숙해진 곳에서 정체되고 싶지 않더라고요. 그동안 해보지 않은 웹 쪽을 해보고 싶어 웹을 다룰 수 있는 새로운 분야로 이직해야겠다고 결심했습니다.&nbsp;</p><p class="c-cJFoND"></p><p class="c-cJFoND">이직을 결심한 후 회사를 몇 개 추려보니 업계에서 일 좀 잘한다는 사람이 모여있고 치열하게 성장할 수 있는 회사를 가고 싶다고 생각했는데 당근뿐이더라고요. 탈락의 고배를 마셔야 했지만 3번 지원했고, 결국 이렇게 당근에 오게 됐습니다. 당근에서 일할 수 있게 되어 진심으로 기뻐요.&nbsp;</p><p class="c-cJFoND"></p><h3 class="c-gtqMoS"><strong>Q. 기대했던 당근의 모습대로 일하고 계신가요? 무슨 일을 하고 계신지도 궁금해요.</strong></h3><p class="c-cJFoND">새로운 것에 도전해보고 싶어 당근에 왔는데, 기본적으로 일을 좋아하고 주도적으로 이끌면서 몰입하는 사람들이 모여 있어요.&nbsp;지금 하는 일은 광고실에서 당근의 광고 플랫폼을 만들고 있는데요. 매일 아침 Slack 대시보드를 통해 광고 지표를 모두가 볼 수 있는데, 매일 상승세가 보이니 동기부여가 잘 되더라고요. 제가 입사한 시점 기준 5~6배 증가한 상황인데, 팀 전체가 하나의 목표에 <span style="background:#FFC4F7">강하게 몰입</span>하는 문화가 좋아요. 이런저런 어려움과 고난이 있지만, 지표 자체가 워낙 잘 나오고 있다 보니 그걸 해결하는 과정도 즐겁더라고요. 제품이 크는 게 눈에 보인다고 해야 하나요. 우리가 만든 제품이 시장에서 좋은 평가를 받는 걸 경험하니 그게 곧 큰 원동력이 돼요. 광고실은 인원 수도 빠르게 늘고, 양적으로 질적으로 모두 성장하고 있다고 느껴요.</p><p class="c-cJFoND"></p><p class="c-cJFoND">몰입과 협업의 힘을 가장 크게 경험을 했던 건 ‘당근 광고 전문가 모드’를 만들 때였어요. 그동안 당근 서비스는 대부분 앱 안에서 제공될 뿐 사용자를 대상으로 웹 기반 서비스가 제공되는 것은 없었는데요. 광고에 대해 잘 아시는 소상공인 분들이나 전문 마케터등을 상대로 한 광고 서비스 플랫폼을 만들어야겠다는 필요성이 생겼어요. 기존 플랫폼도 계속 만들어 나가야 하기 때문에 각 파트별 인력이 절대적으로 부족한 상황이었음에도 몇몇 백엔드 엔지니어가 열정적으로 나서서 프론트엔드의 역할까지 해 나가면서 굉장히 짧은 시간 안에 <a data-id="post-hyperlink" data-link="https://ads-pro.business.daangn.com/" href="https://ads-pro.business.daangn.com/">당근 광고 전문가 모드</a>를 런칭했습니다. 이 때 다들 힘들기도 했지만 몰입해서 한 팀으로서 일하면서 본인의 역량 이상으로 일을 해 내는 동료들의 모습에 큰 자극과 감명을 받았어요. 이미 1년도 더 된 과거의 일이지만 그때 함께 몰입했던 경험은 아직도 기분 좋은 기억으로 남아있습니다.</p><p class="c-cJFoND"></p><p class="c-cJFoND">이런 몰입의 경험은 한 번의 경험에 그치지 않더라고요. 짧은 시간 안에 함께 몰입하고 성취한 경험은 <span style="background:#FFC4F7">두터운 신뢰</span>로 쌓여 회사와 구성원 모두에게 큰 건강한 자극이 되는 걸 느꼈어요. 몰입하다보니 때론 늦은 시간까지 일하기도 했지만, 그 누구도 누가 시켜서가 아니라 한 팀으로서 이 프로젝트를 즐기면서 또 동시에 최대한 확실한 목표를 달성하기 위해 한마음으로 몰두하는 경험이 정말 좋았어요.&nbsp;</p><p class="c-cJFoND"></p><h3 class="c-gtqMoS"><strong>Q. 당근에서 백엔드 엔지니어로서 일할 때 가장 매력적인 업무 환경은 어떤 게 있을까요?&nbsp;</strong></h3><p class="c-cJFoND">앞서 이야기한 몰입의 문화가 가장 크겠지만, <span style="background:#FFC4F7">당근의 트래픽 수 자체</span>도 크게 매력적이라고 생각해요. 당근의 광고 플랫폼은 당근을 사용하는 사용자의 모든 트래픽을 받아서 짧은 시간 안에 광고를 내보내고 그 안에서 회사의 안정적인 BM으로도 역할하고 있는데요. 하루 2억 건이 넘는 광고 요청이 들어오는 규모의 트래픽을 받아낼 시스템을 어떻게 구성할지, 인프라 레벨까지 보거나 참여할 수 있는 환경이 엔지니어에게는 큰 성장의 기회가 될 거라고 생각해요.&nbsp;</p><p class="c-cJFoND"></p><p class="c-cJFoND">MAU가 큰 서비스에서 자체 광고를 운영한다는 것은 사실 큰 품이 드는 일이에요. 플랫폼 전체의 트래픽을 안정적으로 받아내는 동시에 사용자가 불편함을 느끼지 않도록 아주 빠른 시간 안에 광고를 보내줘야 하는데요. 대형 포털사나 대기업의 데이터 전담 조직 빼고는 해볼 수 없는 수준의 데이터 플랫폼을 고민하고 운영할 수 있어요. 광고주와 사용자 상대로 모든 트래픽을 버티면서 서비스를 해내는 게 백엔드 엔지니어가 성장할 수 있는 큰 매력 포인트예요. 보통 인프라 쪽은 개발자가 접근할 수 없는 것들이 있는데, 당근에서는 보안 정책 등에 위배되지 않는 선에서 인프라팀, 보안팀과 가깝게 협업하며 기여할 수도 있어요. 공용 서비스는 먼저 제안해서 직접 만들기도 하고요. 그만큼 누구든 자신의 일에 몰입할 수 있어요.</p><p class="c-cJFoND"></p><p class="c-cJFoND">또 한 가지 꼽자면... 백엔드 언어가 굉장히 다양하다는 것도 있어요. 쉽게 말하면 <span style="background:#FFC4F7">기술 스택의 자유도</span>가 굉장히 높은 편인데요. 장점이자 단점일 수도 있지만, 실패를 두려워하지 않고 도전을 장려하고 그런 분위기에서 동료들을 믿고 성장할 수 있는 문화가 있다는 게 좋은 포인트라고 생각해요. 가끔 팀끼리 서로 만나 이야기 나누는 자리도 있는데, 어제 나온 기술을 오늘 도입하는 팀을 보고 있으면 정말 흥미로워요. 같은 당근 안에서도 팀마다, 또 파트마다 문화가 저마다 특징을 가진 채로 점점 발전하고 있는 것 같아요.&nbsp;</p><p class="c-cJFoND"></p><h3 class="c-gtqMoS"><strong>Q. 당근의 전반적인 개발 문화도 궁금해요.&nbsp;</strong></h3><p class="c-cJFoND">문화라고 할 수 있으려나 모르겠지만, <span style="background:#FFC4F7">뛰어난 동료</span>가 정말 많아요. 잘하는 개발자 옆에, 또 잘하는 개발자가 있는 느낌이랄까요. 이직할 당시에 ‘우리는 어떤 회사에 다니고 싶은가?’라고 업계 사람들과 이야기 나눈 적이 있는데요. 프로덕트나 도메인이 아주 큰 흥미 없더라도 결국 함께 일하는 동료가 유능하고 신뢰할 수 있으면 재미있게 다닐 수 있을 거라는 말에 모두가 고개를 끄덕였어요. 당근에는 내 등을 맡길 수 있는 사람이 많아요. 등을 맡긴다, 등을 맞댄다는 게 정말 쉬운 일이 아닌데 ‘뭘해도 만들 수 있겠다’ 싶은 동료가 많아 서로 신뢰할 수 있게 되더라고요.&nbsp;</p><p class="c-cJFoND"></p><p class="c-cJFoND">나아가 회사 자체의 문화가 개발자 중심의 문화라는 것도 인상 깊어요. 당근은 모두가 한 명의 사업가, 대표처럼 프로덕트를 만드는 메이커라고 생각하는데요. 아무래도 창업자와 초기 멤버 대부분이 개발자였다 보니, 개발자 중심으로 사고하고 업무하는 문화가 자연스러워진 것 같아요.&nbsp;</p><p class="c-cJFoND"></p><h3 class="c-gtqMoS"><strong>Q. 일에 대한 몰입력이 굉장히 강한 것 같아요. 앞으로의 커리어 계획이 있으신가요?&nbsp;</strong></h3><p class="c-cJFoND">광고실에서 커리어에 있어서 어느정도 목표를 이루고 난 후에는, 새로운 서비스를 바닥부터 만들어보고 싶다는 생각이 있어요. 당근에는 창업을 꿈꾸는 사람들이 많이 모여 있어요. 저도 언젠가<strong> 당근에서의 경험을 토대로 세상을 더 이롭게 하는 서비스를 만들어 보고 싶다</strong>는 꿈을 키우고 있어요.&nbsp;</p><p class="c-cJFoND"></p><p class="c-cJFoND">회사에서의 개인적인 목표도 있어요. 같이 일할 때 든든한 사람이 되고 싶어요. 기술적으로도, 인격적으로도요. 욕심 같아서는 “저 사람에게 어떤 일이던 맡기면 원하는 결과물을 얻을 수 있어!” 정도의 동료가 되고 싶다는 욕심이 있지만, 최소한 “같이 일하기 좋았던 사람” 정도로는 기억됐으면 좋겠다는 마음으로 열심히 하고 있어요. <strong>서로에게 좋은 동료가 되어주고 싶다는 마음이 큰 원동력이 돼요. </strong></p></section><section class="c-icNJoE"><svg width="70" height="30" viewBox="0 0 300 200"><line x1="60" x2="400" y1="100" y2="100" stroke="#adb1ba" stroke-width="50" stroke-linecap="round" stroke-dasharray="1, 120"></line></svg></section><section class="c-dgmGif"><h3 class="c-gtqMoS"><strong>Q. 마지막으로 당근 지원을 앞둔 엔지니어에게 해주고 싶은 말이 있을까요?</strong></h3><p class="c-cJFoND"><strong>주도적으로 일하는 걸 좋아하신다면 혹은 서비스와 함께 성장하고 싶으신 분</strong>이라면 망설이지 말고 지원하라고 말씀 드리고 싶어요. 저의 사례에서도 그렇듯 여러 단계에서 고배를 마셨다가도 경험과 이력을 쌓고 합류하신 분들도 많아요.&nbsp;</p><p class="c-cJFoND"></p><p class="c-cJFoND">당근은 동네를 연결해 더 나은 사회를 만들어가자는 비전을 가지고 있는데요. 자신이 하는 일이 세상을 더 나은 곳으로 만들어간다는 뿌듯함과 성취감을 경험해보시면 좋겠어요. 비전에 대한 일치도가 중요하지 않다고 생각하시는 분도 있겠지만, 일치되었을 때 그 뿌듯함은 경험해보지 않으면 모를 거라는 생각도 들어요. 특히 광고실은 동네 이웃들이 필요한 광고주와 동네를 살아가는 사용자를 연결하며 가치를 만들어내고 있는데요. 비전을 향해 성장하면서 느끼는 성취감과 성장을 꼭 경험해보셨으면 좋겠어요. </p></section></div>`,
    author: {
      thumbnail:
        "https://about.daangn.com/static/5ec1d0f83d14cc19e5f1004146547909/e9ec68d0-e49d-4071-bf92-78ed3355003f_profile_daangn.png",
      name: "당근",
      description: "당신 근처의 지역 생활 커뮤니티",
    },
    tags: [
      "2024전직군채용",
      "광고",
      "백엔드",
      "뛰어난동료",
      "몰입",
      "개발문화",
    ],
  },
];
